app/views/profiles/_form.html.erb

SELECT "roles".* FROM "roles"
---
    <%= f.label "Role" %><br>
    <%= f.select :roleId, Role.all.collect { |x| [x.name,x.id] }, {:include_blank => "select one"} %>