app/views/pets/_form.html.erb

SELECT "pet_types".* FROM "pet_types"
---
    <%= f.label :type %><br>
    <%= f.select :pettype, PetType.all.collect { |x| [x.name,x.id] },{:include_blank => "select one"} %>