app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments"

  def create
    # @appointment = Appointment.new(appointment_params)
    @appointment.userId = current_user.id

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("doctorId", "userId", "petId", "reminder", "reason", "appointmentDate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"