app/controllers/customer_controller.rb

SELECT "appointments".* FROM "appointments" INNER JOIN pets ON pets.Id = "petId" WHERE "appointments"."userId" = $1  [["userId", 1]]
---
  def index
   @customer = Appointment.select("*").joins('INNER JOIN pets ON pets.Id = "petId"').where(:userId => current_user.id)