app/controllers/pet_types_controller.rb

  def index
    @pet_types = PetType.all
---
SELECT "pet_types".* FROM "pet_types"

  def create
    @pet_type = PetType.new(pet_type_params)

    respond_to do |format|
      if @pet_type.save
---
INSERT INTO "pet_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Dog"], ["created_at", "2015-10-07 05:14:02.460365"], ["updated_at", "2015-10-07 05:14:02.460365"]]

    def set_pet_type
      @pet_type = PetType.find(params[:id])
---
SELECT  "pet_types".* FROM "pet_types" WHERE "pet_types"."id" = $1 LIMIT 1  [["id", 1]]