app/controllers/pets_controller.rb

  def index
    @pets = Pet.all
---
SELECT "pets".* FROM "pets"

  def create
    @pet = Pet.new(params[:pet])

    respond_to do |format|
      if @pet.save
---
INSERT INTO "pets" ("name", "pettype", "breed", "age", "weight", "lastvisit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_pet
      @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT 1  [["id", 2]]