app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
---
  def index
    @profiles = Profile.all

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_profile
      @profile = Profile.find(params[:id])