app/views/appointments/_form.html.erb

SELECT "pets".* FROM "pets"
---
    <%= f.label "Pet" %><br>
    <%= f.select :petId, Pet.all.collect { |x| [x.name,x.id]},{:include_blank => "select one"} %>